Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.AirSystemId
The air system used for this zone equipment, if applicable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.VRFLoopId
The Varible Refrigerant Flow loop for the VRF fan coil equipment type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.ChilledWaterLoopId
The chilled water loop used for the chilled water option of cooling coil.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.CondenserWaterLoopId
The condenser water loop used for the direction expansion water cooled option of cooling coil.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.HotWaterLoopId
The water loop element id for the hot-water heating coil.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1